import { Component } from '@angular/core';

@Component({
  selector: 'app-business-solutions',
  templateUrl: './business-solutions.component.html',
  styleUrl: './business-solutions.component.scss',
})
export class BusinessSolutionsComponent {
  solutions = [
    {
      title: 'Для сотрудников',
      text: [
        'Оптимизация техник продаж с персонализированными рекомендациями',
        'Повышение качества обслуживания клиентов',
      ],
      color: 'blue',
    },
    {
      title: 'Для отделов обучения и методологов',
      text: [
        'Анализ данных для разработки эффективных программ обучения',
        'Оценка качества обучения сотрудников и стажеров',
      ],
      color: 'orange',
    },
    {
      title: 'Для директоров магазинов',
      text: [
        'Мониторинг качества работы сотрудников',
        'Повышение показателей работы сотрудников',
        'Индивидуальная обратная связь',
      ],
      color: 'green',
    },
    {
      title: 'Для руководителей и коммерческого отдела',
      text: [
        'Мониторинг эффективности бизнеса',
        'Анализ внедрения лучших практик, повышающих продажи',
        'Мониторинг производительности сотрудников всей компании',
      ],
      color: 'green',
    },
    {
      title: 'Для отдела контроля качества',
      text: [
        'Мониторинг конфликтных ситуаций',
        'Анализ влияния речи сотрудника на NPS',
      ],
      color: 'orange',
    },
    {
      title: 'Для отдела безопасности',
      text: ['Мониторинг фрода'],
      color: 'blue',
    },
  ];
}
